FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/Замены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Замены</Name>
			<Comment>Замены</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Группа</Name>
					<Comment>Группа замены</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество замены</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗамены</Name>
					<Comment>Дата замены</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Comment>Дата обновления</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание замены</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Номер по каталогу номенклатуры</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АртикулЗамены</Name>
					<Comment>Номер по каталогу номенклатуры замены</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АртикулДляПоиска</Name>
					<Comment>Номер для поиска по каталогу номенклатуры</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АртикулЗаменыДляПоиска</Name>
					<Comment>Номер для поиска по каталогу номенклатуры замены</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Comment>Производитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Comment>Номенклатура</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Пользователь, создавший запись о номенклатуре</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата создания записи о номенклатуре</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеИностранное</Name>
					<Comment>Иностранное наименование</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Код производителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Comment>Тип номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Comment>Вид номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Comment>Вид платежа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Comment>Базовая единица измерения номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяЕдиницаИзмерения</Name>
					<Comment>Основная единица измерения номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС по умолчанию для оформления документов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаУчета</Name>
					<Comment>Используется для ведения дополнительного учета валютной себестомости и цен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределенияДопРасходов</Name>
					<Comment>Заполняется только для услуг и управляет распределением суммы по услуге в пределах документа</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРаспределенияДопРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДопРасходов</Name>
					<Comment>Заполняется для услуг. По этой статье происходит начисление расходов / доходов при поставке / отгрузке</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГТД</Name>
					<Comment>ГТД по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Comment>Страна происхождения по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокХраненияТовара</Name>
					<Comment>(в днях) из конфигурации Торговый Комплекс</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Comment>Процент наценки по умолчанию (для расчета цен)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Comment>Производитель товара</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаАвтокаталога</Name>
					<Comment>Индекс картинки номенклатуры в автокаталоге</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаНДСПоРеализации</Name>
					<Comment>Счет учета НДС по реализации используется при выгрузке в бухгалтерию</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Регламентированный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьПоставок</Name>
					<Comment>Количество, которое можем заказывать у поставщика</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнятаСПроизводства</Name>
					<Comment>Номенклатура снята с производства</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретПродажи</Name>
					<Comment>Запрет продажи номенклатуры</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретЗакупки</Name>
					<Comment>Запрет закупки номенклатуры</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Comment>Обычно соответствует массе Брутто в основной единице измерения массы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Comment>Соотвестует объему в основной единице измерения объема</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АртикулДляПоиска</Name>
					<Comment>Артикул для поиска</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКПД2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОКПД2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прослеживаемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SafetyStock</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БТ_ИсключитьОтслеживаниеНепродТов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставНабора</Name>
					<Comment>Состав набора</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЯчейкиХраненияУдалить</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СкладКомпании</Name>
							<Comment>Склад компании</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯчейкаХранения</Name>
							<Comment>Ячейка хранения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯчейкиХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/Замены/Ext/ManagerModule.bsl
Функция ПодставитьПараметрыВСтроку(СтрокаСПараметрами, Параметр1 = Неопределено, Параметр2 = Неопределено, Параметр3 = Неопределено, Параметр4 = Неопределено)
	СтрокаСПараметрами = СтрЗаменить(СтрокаСПараметрами, "%1", Параметр1);
	СтрокаСПараметрами = СтрЗаменить(СтрокаСПараметрами, "%2", Параметр2);
	СтрокаСПараметрами = СтрЗаменить(СтрокаСПараметрами, "%3", Параметр3);
	СтрокаСПараметрами = СтрЗаменить(СтрокаСПараметрами, "%4", Параметр4);
	Возврат СтрокаСПараметрами;
КонецФункции

//Процедура заполняет артикул, артикул замены, преобразует артикул для поиска и артикул замены для поиска
Процедура ЗаполнитьАртикулДляПоиска() Экспорт 
	
	#Если Клиент Тогда
	Состояние(НСтр("ru='Проверка замен.'"));
	#КонецЕсли
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Замены.АртикулДляПоиска,
		|	Замены.АртикулЗаменыДляПоиска,
		|	Замены.Производитель КАК Производитель,
		|	Замены.Группа,
		|	Замены.Количество,
		|	Замены.ДатаЗамены,
		|	Замены.ДатаОбновления,
		|	Замены.Описание,
		|	Замены.Артикул,
		|	Замены.АртикулЗамены
		|ИЗ
		|	РегистрСведений.Замены КАК Замены
		|ГДЕ
		|	(Замены.Артикул = """"
		|			ИЛИ Замены.АртикулЗамены = """")
		|ИТОГИ ПО
		|	Производитель";
				   
	Результат = Запрос.Выполнить();			   
	
	Если Результат.Пустой() Тогда
		#Если Клиент Тогда
		Сообщить(НСтр("ru='Обновление регистра сведений ""Замены"" не требуется'"));
		#КонецЕсли
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
	Сообщить(НСтр("ru='Обновление регистра сведений ""Замены""'"));
	#КонецЕсли
	
	Выборка = Результат.Выбрать();
	
	РазмерВыборки = Выборка.Количество();
	
	ВыборкаПроизводителей = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СчВсего	= 0;
	СчЦикла	= 0;
	ПроцентПрогресса = 0;
	
	Пока ВыборкаПроизводителей.Следующий() Цикл
		
		// Каждого производителя в отдельной транзакции
		НачатьТранзакцию();
		
		ПроизводительНаименование = ?(обЗначениеНеЗаполнено(ВыборкаПроизводителей.Производитель), "<Не указан>", ВыборкаПроизводителей.Производитель.Наименование);
		#Если Клиент Тогда
		Состояние(ПодставитьПараметрыВСтроку(НСтр("ru='Обновление регистра сведений ""Замены"": %1%, производитель %2'"),
												  Строка(ПроцентПрогресса),
												  ПроизводительНаименование));
		#КонецЕсли
		СчВсего = СчВсего + 1;
		Выборка = ВыборкаПроизводителей.Выбрать();
		
		НаборЗаписей = РегистрыСведений.Замены.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Производитель.Установить(ВыборкаПроизводителей.Производитель, Истина);
		НаборЗаписей.Прочитать();
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		
		Если НаборЗаписей.Количество() > 20000 Тогда
			// Сообщим про существенного производителя
			// Большой набор, запись может быть долгой!
			#Если Клиент Тогда
			Сообщить(ПодставитьПараметрыВСтроку(НСтр("ru='Для производителя %1 в регистре найдено %2 записей. Обновление может занять длительное время. Подождите!'"),
												ПроизводительНаименование,
												Строка(НаборЗаписей.Количество())));
			#КонецЕсли
		КонецЕсли;
		
		Если НаборЗаписей.Количество() > 100000 Тогда
			// Будем записывать поштучно!
			
			НаборЗаписей = Неопределено;
			
			РабочийНабор = РегистрыСведений.Замены.СоздатьНаборЗаписей();
			РабочийНабор.Отбор.Производитель.Установить(ВыборкаПроизводителей.Производитель, Истина);
			
			Пока Выборка.Следующий()Цикл
				СчВсего = СчВсего + 1;
				СчЦикла = СчЦикла + 1;
				#Если Клиент Тогда
				Если Цел(СчВсего*100/РазмерВыборки) > ПроцентПрогресса Тогда
					ПроцентПрогресса = Цел(СчВсего*100/РазмерВыборки);
					Состояние(ПодставитьПараметрыВСтроку(НСтр("ru='Обновление регистра сведений ""Замены"": %1%, производитель %2'"),
															  Строка(ПроцентПрогресса),
															  ПроизводительНаименование));
				КонецЕсли;
				#КонецЕсли
				
				РабочийНабор.Отбор.АртикулДляПоиска.		Установить(Выборка.АртикулДляПоиска,		Истина);
				РабочийНабор.Отбор.АртикулЗаменыДляПоиска.	Установить(Выборка.АртикулЗаменыДляПоиска,	Истина);
				РабочийНабор.Прочитать();
				Если РабочийНабор.Количество() = 0 Тогда
					// Запись уже удалена
					Продолжить;
				КонецЕсли;
				
				АртикулДляПоиска = Справочники.Номенклатура.ПреобразоватьВАртикулДляПоиска(Выборка.АртикулДляПоиска, Выборка.Производитель); 
				Если ПустаяСтрока(АртикулДляПоиска)Тогда
					АртикулДляПоиска = СокрЛП(Выборка.АртикулДляПоиска);
				КонецЕсли;
				
				АртикулЗаменыДляПоиска = Справочники.Номенклатура.ПреобразоватьВАртикулДляПоиска(Выборка.АртикулЗаменыДляПоиска, Выборка.Производитель);
				Если ПустаяСтрока(АртикулЗаменыДляПоиска)Тогда
					АртикулЗаменыДляПоиска = СокрЛП(Выборка.АртикулЗаменыДляПоиска);
				КонецЕсли;
				
				// Если Артикулы для поиска и Артикул замены для поиска оказались равны,
				// то такая запись не имеет смысла и мы удалим ее
				// даже если одинаковые артикулы ранее были в регистре (например, "  0567" и "0567"),
				// то на самом деле они не имели смысла!
				Если АртикулДляПоиска = АртикулЗаменыДляПоиска Тогда
					РабочийНабор.Очистить();
					РабочийНабор.ОбменДанными.Загрузка = Истина;
					РабочийНабор.Записать(Истина);
					Продолжить;
				КонецЕсли;
				
				// Если Артикулы для поиска изменились, поищем может новая пара уже есть в регистре?
				Если СокрП(Выборка.АртикулДляПоиска) <> АртикулДляПоиска ИЛИ СокрП(Выборка.АртикулЗаменыДляПоиска) <> АртикулЗаменыДляПоиска Тогда
					Менеджер = РегистрыСведений.Замены.СоздатьМенеджерЗаписи();
					Менеджер.АртикулДляПоиска		= АртикулДляПоиска;
					Менеджер.АртикулЗаменыДляПоиска	= АртикулЗаменыДляПоиска;
					Менеджер.Производитель			= Выборка.Производитель;
					Менеджер.Прочитать();
					Если Менеджер.Выбран() > 0 Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				
				Если СокрП(Выборка.АртикулДляПоиска) = АртикулДляПоиска И СокрП(Выборка.АртикулЗаменыДляПоиска) = АртикулЗаменыДляПоиска Тогда
					// Артикулы для поиска остались без изменений
					// заполним реквизиты для записи
					РабочийНабор[0].Артикул			= СокрЛП(Выборка.АртикулДляПоиска);
					РабочийНабор[0].АртикулЗамены	= СокрЛП(Выборка.АртикулЗаменыДляПоиска);
					
				Иначе
					// Удалим старую запись
					РабочийНабор.Очистить();
					РабочийНабор.ОбменДанными.Загрузка = Истина;
					РабочийНабор.Записать(Истина);
					
					// Добавим новую запись
					РабочийНабор.Отбор.АртикулДляПоиска.		Установить(АртикулДляПоиска,		Истина);
					РабочийНабор.Отбор.АртикулЗаменыДляПоиска.	Установить(АртикулЗаменыДляПоиска,	Истина);
					НоваяСтрока = РабочийНабор.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
					НоваяСтрока.АртикулДляПоиска		= АртикулДляПоиска;
					НоваяСтрока.АртикулЗаменыДляПоиска	= АртикулЗаменыДляПоиска;
					НоваяСтрока.Артикул					= СокрЛП(Выборка.АртикулДляПоиска);
					НоваяСтрока.АртикулЗамены			= СокрЛП(Выборка.АртикулЗаменыДляПоиска);
					
				КонецЕсли;
				
				РабочийНабор.ОбменДанными.Загрузка = Истина;
				РабочийНабор.Записать(Истина);
				
				Если СчЦикла > 10000 Тогда
					ЗафиксироватьТранзакцию();
					НачатьТранзакцию();
					СчЦикла = 0;
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			// Попытаемся записать все через большой набор
			тзНаборЗаписей = НаборЗаписей.Выгрузить();
			тзНаборЗаписей.Индексы.Добавить("АртикулДляПоиска,АртикулЗаменыДляПоиска");
		
			Пока Выборка.Следующий()Цикл
				СчВсего = СчВсего + 1;
				#Если Клиент Тогда
				Если Цел(СчВсего*100/РазмерВыборки) > ПроцентПрогресса Тогда
					ПроцентПрогресса = Цел(СчВсего*100/РазмерВыборки);
					Состояние(ПодставитьПараметрыВСтроку(НСтр("ru='Обновление регистра сведений ""Замены"": %1%, производитель %2'"),
															  Строка(ПроцентПрогресса),
															  ПроизводительНаименование));
				КонецЕсли;
				#КонецЕсли
				
				НайденныеСтроки = тзНаборЗаписей.НайтиСтроки(Новый Структура("АртикулДляПоиска, АртикулЗаменыДляПоиска", Выборка.АртикулДляПоиска, Выборка.АртикулЗаменыДляПоиска));
				Если НайденныеСтроки.Количество() = 0 Тогда
					// Таких строк уже нет, они могли ранее быть удалены
					Продолжить;
				КонецЕсли;
				
				АртикулДляПоиска = Справочники.Номенклатура.ПреобразоватьВАртикулДляПоиска(Выборка.АртикулДляПоиска, Выборка.Производитель); 
				Если ПустаяСтрока(АртикулДляПоиска)Тогда
					АртикулДляПоиска = СокрЛП(Выборка.АртикулДляПоиска);
				КонецЕсли;
				
				АртикулЗаменыДляПоиска = Справочники.Номенклатура.ПреобразоватьВАртикулДляПоиска(Выборка.АртикулЗаменыДляПоиска, Выборка.Производитель);
				Если ПустаяСтрока(АртикулЗаменыДляПоиска)Тогда
					АртикулЗаменыДляПоиска = СокрЛП(Выборка.АртикулЗаменыДляПоиска);
				КонецЕсли;
				
				Если АртикулДляПоиска = АртикулЗаменыДляПоиска Тогда
					// Если преобразованные переменные АртикулДляПоиска и АртикулЗаменыДляПоиска оказались равны,
					// то такая запись не имеет смысла и мы удалим ее
					// даже если одинаковые артикулы были в регистре (например, "  0567" и "0567"), то на самом деле они не имели смысла!
					Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
						тзНаборЗаписей.Удалить(НайденнаяСтрока);
					КонецЦикла;
					Продолжить;
				КонецЕсли;
				
				ПерваяСтрока = Истина;
				Если СокрП(Выборка.АртикулДляПоиска) <> АртикулДляПоиска ИЛИ СокрП(Выборка.АртикулЗаменыДляПоиска) <> АртикулЗаменыДляПоиска Тогда
					// Артикулы изменились, поищем новую пару в таблице
					НайденныеСтрокиНовые = тзНаборЗаписей.НайтиСтроки(Новый Структура("АртикулДляПоиска, АртикулЗаменыДляПоиска", АртикулДляПоиска, АртикулЗаменыДляПоиска));
					Если НайденныеСтрокиНовые.Количество() > 0 Тогда
						// Нужная пара уже есть в регистре
						// Все старые строки будем удалять,
						// рано или поздно по выборке дойдем до этой строки и преобразуем ее или эта строка уже преобразована!
						ПерваяСтрока = Ложь;
					КонецЕсли;
				КонецЕсли;
				
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					Если ПерваяСтрока Тогда
						ПерваяСтрока = Ложь;
						НайденнаяСтрока.Артикул					= СокрЛП(Выборка.АртикулДляПоиска);
						НайденнаяСтрока.АртикулЗамены			= СокрЛП(Выборка.АртикулЗаменыДляПоиска);
						НайденнаяСтрока.АртикулДляПоиска		= АртикулДляПоиска;
						НайденнаяСтрока.АртикулЗаменыДляПоиска	= АртикулЗаменыДляПоиска;
					Иначе
						// Могли быть строки с артикулом вида " 0567" и "0567"
						// ранее они считались разными артикулами, теперь одинаковые
						тзНаборЗаписей.Удалить(НайденнаяСтрока);
					КонецЕсли;
				КонецЦикла;
				
			КонецЦикла;
			
			НаборЗаписей.Загрузить(тзНаборЗаписей);
			НаборЗаписей.Записать();
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	КонецЦикла;
	
		
	#Если Клиент Тогда
	Сообщить(НСтр("ru='Обновление регистра сведений ""Замены"" завершено.'"));
	#КонецЕсли
	
КонецПроцедуры //ЗаполнитьАртикулДляПоиска()
